japan_alphabet = {
    'А': 'ка', 'И': 'ки', 'Р': 'ши', 'Ш': 'ли',
    'Б': 'зу', 'Й': 'фу', 'С': 'ари', 'Щ': 'ни',
    'В': 'ру', 'К': 'ме', 'Т': 'чи', 'Ъ': 'д',
    'Г': 'джи', 'Л': 'та', 'У': 'мей', 'Ы': 'хе',
    'Д': 'те', 'М': 'рин', 'Ф': 'лу', 'Ь': 'ксе',
    'Е': 'ку', 'Ё': 'ку', 'Н': 'то', 'Х': 'ри', 'Э': 'га',
    'Ж': 'зу', 'О': 'мо', 'Ц': 'ми', 'Ю': 'до',
    'З': 'з', 'П': 'но', 'Ч': 'зи', 'Я': 'ма'
}

translate_name = input().strip().upper()

output = ''
for letter in translate_name:
    output += japan_alphabet[letter].lower()
output = output[0].upper() + output[1:]
print(output)